[{"name":"Sidney Needs a Kidney","blurb":"You're watching a dinner party. There's Mark and Sidney. You like Mark and Sidney. Mark and Sidney need everything to be perfect, because things haven't been perfect lately. But they have a plan. And it's a good plan. Isn't it?","times":["13th July at 3:15pm"],"venue":{"place":"10 : Theatre Passe Muraille Mainspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Sincerely, The Rebels Club","blurb":"A hilarious parody mash-up: Imagine your beloved Star Wars characters as teenagers in the iconic detention of The Breakfast Club - shenanigans ensue!","times":["13th July at 4:30pm","14th July at 7:45pm"],"venue":{"place":"1 : Tarragon Theatre Mainspace","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Things the Trees Taught Them","blurb":"A play about the Canadian Rite of Passage: tree planting. \n\nThe audience will be brought into the world of tree planters: sore feet, extreme dehydration, being amongst \"regular civilization\" on day-off and the rookie stare.\n\nJoin us as we plunge into the depths of questioning everything, wondering about humanity and spending ten hours in wet boots, all while going into survival mode just to get through the day. \n\nWe promise you will come out the other end, a little worse for wear, but more alive. This will be the best worst experience of your life.","times":["14th July at 3:45pm"],"venue":{"place":"13 : Factory Theatre Studio","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Outside Ethel: Inside","blurb":"Ethel lives alone (well, mostly).\nShe is advanced in years.\nShe is having some trouble actually getting out the door.\nWill she get \"bye\" with a little help from her friends?\n\nTragedy! Loneliness! Ballet!!\nA Clown Dramedy","times":["13th July at 10:15pm","14th July at 7:45pm"],"venue":{"place":"15 : Streetcar Crowsnest Scotiabank Studio","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"In Ireland We Rented a Car from Criminals","blurb":"In Ireland We Rented a Car from Criminals follows Tom and Mary over the rocky hillsides of County Clare in search of their long-dead ancestors in the famine graveyards. Along the way, they meet an Irish dozen of storytellers -- the landlady at the B&B, the tour guide at the stone fort, the old woman in the cotter’s hut, the sister at the parish records office, and the graveyard historian, plus farmers, singers, musicians, house boaters, and friendly Irish motorists. We also meet Aidan, the manager of the car-rental kiosk, who’s planned an unhappy ending for Tom and Mary’s vacation.","times":["13th July at 6:45pm"],"venue":{"place":"14 : Streetcar Crowsnest Guloien Theatre","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Unbridled Futurism","blurb":"Captain Nick Di Gaetano is an astronaut from another Earth and inter-dimensional refugee. Pursued across space and time by genocidal, iPhone-wielding raccoons he searches the multiverse for a way back home to his wife and cat. Accompanied by his AI companion Mission Control and featuring original songs, a live band and DIY Video this show reveals that if you ever thought your life had no meaning, it does now.\n“Exceedingly entertaining”, “Strange and Surreal”, Funny and Fleet”, “Weird as f@ck” and “A fun, weird mixture of TV’s Sliders, David Bowie’s Space Oddity, and Mystery Science Theatre 3000”.","times":["13th July at 9:15pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Love Notes","blurb":"I can't explain the feeling's plain to me, say can't you see... A medley of live music and movement to share our stories of infatuation, romance, family, and friendship. A soundtrack to fall in love to; and maybe you’re not listening alone.","times":["14th July at 2:15pm"],"venue":{"place":"12 : Factory Theatre Mainspace","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"A Woman's Guide to Peeing Outside","blurb":"Ever wondered how to perform \"The Assisted Pee over Water”? Still struggling with the death of Jack Dawson? Join Multi Award Winner, Holly M. Brinkman, on a coming-of-age adventure. You’ll laugh. You’ll cry. You’ll try not to pee your pants. “We all need a Pee Buddy, and regardless of gender, should be a Pee Buddy to others.” ~ Montreal Theatre Hub","times":["14th July at 3:15pm"],"venue":{"place":"7 : St. Vladimir Institute","address":"620 Spadina AveTorontoOntarioM5S 2H4"}},{"name":"Woke 'N Broke","blurb":"\"And lo! Jesus made the 5 loaves feed hundreds. And the millennials were like, \"Can I get mine toasted with avocado?\" (WARNING: This comedy sketch revue may contain traces of millennials and avocados)","times":["13th July at 1:00pm"],"venue":{"place":"8 : Helen Gardiner Phelan Playhouse","address":"79A Saint George StTorontoOntarioM5S 3L8"}},{"name":"The Road to Damascus","blurb":"Two men in a police station in suburban France: a police officer and a young man suspected of wanting to join a terrorist group. One defends the many opportunities given by our society, the other represents a youth lost to disillusionment. Thus begins a tense interrogation, a game of chess, with each opponent trying to throw the other one off their tracks. Their visions of the Western world confront each other, clash ... who will convert whom?\nHaving toured Belgium and France, The Road to Damascus makes its English-language debut at the Toronto Fringe.","times":["13th July at 2:45pm"],"venue":{"place":"2 : Tarragon Theatre Extraspace","address":"30 Bridgman AveOntarioM5R 1X3"}},{"name":"The ADHD Project","blurb":"Award-winning storyteller Carlyn Rhamey shares the trials and triumphs of growing up a little bit \"Special” and embracing what makes us different. From her diagnosis and placement in a segregated classroom to navigating her \"superpower” now as an adult, this is a hilariously honest journey exploring ADHD and neurodiversity. Welcome to Carlyn’s world of chaos, creativity and combat with her mind.\n\"A talented storyteller, with a great sense of comic timing\" Edmonton Journal ★★★★\n“Hilarious...with a very heartwarming message” Vue Weekly ★★★★\n\"Captivating\" Onstage Ottawa ★★★★\n \"You fall in love with the story and the storyteller alike\" Theatre in London ★★★★","times":["13th July at 8:00pm"],"venue":{"place":"11 : Theatre Passe Muraille Backspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"It's Getting Hot in Here!","blurb":"The polar ice caps are melting, global temperatures are on the rise and at a time when we need unity the most, the left and right are more divided than ever. With the world going up in flames, what’s a theatre company to do?! \nA sketch revue about changing climates, both political and environmental.","times":["14th July at 8:15pm"],"venue":{"place":"6 : Annex Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Break-Up Diet","blurb":"\"That moment his eyes flitted to his cell phone on the desk beside me. And I knew.\" \n\nBetrayal, lies, truth, online dating! Poor life choices punctuated with original alternative songs. \n\nThis is storytelling at its most vulnerable, buoyed by wry Brit wit. \n\nLived and performed by one of Toronto’s most highly respected alt artists and her band Mrs. Torrance.\n\nSuitable for 16 years and up.\n\nThe Adams Prize is generously supported by the Pat & Tony Adams Freedom Fund for the Arts.","times":["14th July at 1:45pm"],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"Dandelion","blurb":"5-year-old Julian has a marvellous imagination and appetite for wordplay. His dad performs Off Broadway and is a Canadian Comedy Award Winner. This is the comedy of his dad trying to keep up.\n\nWith spot-on comedic timing, jaw-dropping physicality, and live science experiments, Dandelion stays with you long after the curtains close.\n\nMalkin is a 20x Best-of-Fest winner for his JAMES & JAMESY shows.\n\n★★★★★, 2 for Tea (CBC & WFP)\n★★★★★, High Tea (Torontoist & London Free Press)\n★★★★★, In the Dark (CBC & London Free Press)\n★★★★★, Thunderfoot (WFP & Theatre in London)","times":["13th July at 6:15pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Dinner With Goebbels","blurb":"3 men gather for dinner: \n- 1 invented propaganda\n- 1 exterminated the Jews\n- 1 created the 'War on Terror'... Pull up a chair! \n\n“surprisingly human piece of political theatre” \n“some pretty impressive theatrics”\n“make an effort to see this”\n\t- Mooney on Theatre","times":["13th July at 9:00pm","14th July at 9:00pm"],"venue":{"place":"18 : Trinity-St. Paul's United Church","address":"427 Bloor Street WestTorontoOntarioM5S 1X7"}},{"name":"BFFs","blurb":"Best friends Amanda and Devin are totally real adults who want to celebrate their 30th birthdays at The Most Magical Place On Earth. Only a few things stand in their way: money, jobs, partners and timing. Fuelled by boxed wine and an indie-pop soundtrack, Amanda and Devin are determined to make this trip happen. If only real life didn’t have real responsibilities. Three-time Fringe Festival award winners Bad Dress Productions return with a new original musical by Greg McLeod (Good For Grapes).","times":["13th July at 1:30pm"],"venue":{"place":"10 : Theatre Passe Muraille Mainspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"The Huns","blurb":"The morning after a break-in at a tech company, three co-workers assemble for a conference call to discuss the burglary. What starts as a civilized, professional meeting swiftly devolves into a brutal showdown that puts everyone's careers-- and their hopes for future happiness-- in jeopardy.\n\nWritten by Dora-nominated playwright Michael Ross Albert (\"Anywhere,\" Best of Fringe 2018/Patron's Pick) and directed by Marie Farsi (associate artistic director, Crow's Theatre), \"The Huns\" is a new, menacing workplace comedy about millennial anxieties, minor revolutions, and modern-day barbarians.","times":["14th July at 4:00pm"],"venue":{"place":"14 : Streetcar Crowsnest Guloien Theatre","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Some People To Think About","blurb":"Some People To Think About is a solo comedy show from Canadian Comedy Award-nominee Paul Blinov (Gossamer Obsessions, Rapid Fire Theatre). It's a finely curated collection of strange fools and plausible nonsense: an all-too-honest father, an all-too-desperate screenwriter, and more.","times":["13th July at 3:15pm"],"venue":{"place":"15 : Streetcar Crowsnest Scotiabank Studio","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Sketchy Adventures in the Enchanted Forest","blurb":"Once upon a time, there lived an old-fashioned couple and their sheltered daughter who longed for an adventure. One night she sets out into the forest and encounters much more than she bargained for. \nWelcome to the enchanted forest, a place full of outrageously funny characters, epic adventures and maybe even a chance at love. \nJoin our story of unexpected friendships, altered perceptions, monsters, duels, madness and finding out who you are. \nSketch and theatre will collide in this laugh-out-loud, mystical Fringe fairy tale.","times":["14th July at 5:15pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Murmurs","blurb":"We’re living in interesting times.\n\nA look at the human condition with a focus on contributing a new perspective. In memory of his loving father, Drew Taylor takes us on a trip down memory lane, along the way paying tribute to intellectual luminaries Brene Brown, Yuval Noah Harari and Barbara Coloroso.","times":["13th July at 3:15pm"],"venue":{"place":"3 : Tarragon Theatre Solo Room","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"GLIMPSE","blurb":"What does it mean to \"have it all\"? Through the lens of dance, Glimpse zooms in on the anxieties felt by young adults in precarious times. Cutting through the artifice of selfies and status updates, ParaSOUL Dance examines what remains hidden from view when we perform publicly only the most successful versions of ourselves. Deploying solo and group vignettes that blend contemporary, capoeira, and house, the four-woman cast tempers vulnerability with humour. Glimpse injects into popular social scripts of \"living your best life\" the counter-rhythms of embracing the almost and of loving what is.","times":["13th July at 4:30pm"],"venue":{"place":"12 : Factory Theatre Mainspace","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Molly Bloom","blurb":"“Genius.” “Bawdy.” “Nothing but praise.”\nMolly Bloom is an original adaptation of James Joyce's Ulysses’ final chapter. Four actors collectively play the consciousness of Molly Bloom as she lies awake in bed in this sensual and shocking exploration of one woman’s psyche. As the four women move and speak as one, Joyce’s infamous soliloquy is refashioned into a four person one-woman show. Molly Bloom is a fascinating, vivacious, and hilarious race through one hour of unrelenting thought.","times":["13th July at 8:30pm"],"venue":{"place":"8 : Helen Gardiner Phelan Playhouse","address":"79A Saint George StTorontoOntarioM5S 3L8"}},{"name":"Reefer Madness: Origins","blurb":"During the Depression, a time when hope and prosperity is far from the American mind, a common enemy is created: the Mexican weed with roots in hell, marijuana. Known as hemp and cannabis and used industrially and medically across the globe, \"marijuana\" is promoted as the cause of moral depravity among young people and societal decay. With the support of powerful allies with various interests, economic or otherwise, the Federal Commissioner of Narcotics Harry Anslinger will stop at nothing to warp the image of cannabis into what will shape international drug scheduling for generations to come.","times":["13th July at 2:15pm"],"venue":{"place":"1 : Tarragon Theatre Mainspace","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Old-ish","blurb":"It's about aging and death - only WAY funnier! Susan's fifth one-woman comedy travels the hilarious and rocky road from denial to grumpy acceptance of getting older.\nThe Pick of The Fringe, 2018 Nanaimo Fringe.\n\"Freedman sparkles...instantly likeable...you don't need to be old to appreciate Old-ish.\" - Winnipeg Free Press. \n\"Tells it like it is, with biting humour, grace, an amazing attitude and an incredible amount of sass. Snappy, fast paced dialogue... a hidden gem of the fest.\" - The Jenny Revue Winnipeg.\n★★★★1/2 Stars, \"Riveting storyteller\"- Edmonton Sun. \n★★★★Stars, \"Roars of laughter...excellent storyteller...wry and funny\"- CBC Manitoba.","times":["13th July at 1:00pm"],"venue":{"place":"11 : Theatre Passe Muraille Backspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"LIGHTS! CAMERA! ODD JOBS?","blurb":"Join an actor in the quest for a career that goes from acting work to the many odd jobs in between. Stories of acting gigs, interwoven with real life roles such as cherry picker to call centre representative. Unexpected discoveries and reflections from the work. A journey towards...","times":["13th July at 4:45pm"],"venue":{"place":"6 : Annex Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Box","blurb":"Two Guards. One Box. No Clue!\n\nFrom the creators of the Fringe hits ‘Waking’ (2016) and ‘The Girl in the Photograph’ (2018) comes an outrageously ridiculous and thought-provoking satire about the meaning of work – “Box”. Written and directed by Joel Pettigrew and featuring an all-star and multi-cultural cast of dedicated artists and several Fringe alumni, and even a very special celebrity cast member, Arlene Paculan, Box will have you guessing and on the edge of your seat in anticipation. So what’s in the Box? Come and see!\n\nStarring Arlene Paculan, Justin Styles, Lucas James and Thomas Sarigiannidis","times":["13th July at 4:15pm","14th July at 1:00pm"],"venue":{"place":"7 : St. Vladimir Institute","address":"620 Spadina AveTorontoOntarioM5S 2H4"}},{"name":"DEEP END","blurb":"Carina’s turning 18 and is hosting the Birthday POOL Party of the year! Everyone's invited, even Lilly. When do adults intervene in harmless harassment? What happens when life throws you into the deep end? This site specific show that happens in and around a Swimming Pool asks when does \"kids will be kids,\" go to far? \n\nPlease note that as this is a site specific Production the Audience will be required to remove their shoes and enter the pool deck where they will be seated on benches for the duration of the production!","times":["13th July at 8:00pm","14th July at 8:00pm"],"venue":{"place":"17 : Miles Nadal Jewish Community Centre Pool","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Dom Mackie's Poor Life Choices","blurb":"Dom Mackie may only be in his early twenties, but he has already made many stupid decisions in his life. \nFrom how he appeared on a BBC game show, to his very awkward first date, Dom can prove in this sell out show that (like his comedy career) we all make POOR LIFE CHOICES.","times":[],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"A Plague Upon the Doctor's House","blurb":"A murder. A thief. An inheritance. A plague. A comedy set in a very dark and gloomy place -- England in the 18th century. There is a constant fear that the plague will kill you, and if it doesn't, that the Highwayman will. And yet, the darkest things of all lie on the second floor of the doctor's house. There is a devil in this home. A putrid stench of strawberries and rotting corpses. But perhaps most dangerously off all is not the presence of those things, but of simple, mortal men.","times":["13th July at 8:00pm"],"venue":{"place":"13 : Factory Theatre Studio","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Decaying Tongue","blurb":"How do you answer the question “where are you from from”? Aya navigates through life as she experiences culture shocks between her two worlds: Japan and Canada. Will she find peace with her constantly evolving identity? Decaying Tongue explores clash of cultures and what it means to find your footing with a diverse background in the 21st century.\n\nWriter/Director: Kaho Koda, Production Manager: Marina Ho, Stage Manager: Conner Bustamante, Marketing Director: Rutger Wink, Set/Props/Costume Designer: Tracy Kong, Lighting Designer: Dillon Maillet, Sound Designer: Dilpreet Saund, Cast: Sachi Lovatt, Mei Miyazawa, Daniella Dela Pena, Jaemoon Lee, Cory Bertrand","times":["13th July at 1:00pm","14th July at 5:15pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"After the Beep","blurb":"Despite risking death by embarrassment, Pamela presses play on recordings from the answering machine she had as a 1990s teen. Part confessional, part show-and-tell, the voices - from BFFs to wrong numbers - tell the story of an under-supervised over-achiever. The story tracks her life from grades 9 to 12. She grows up quickly, living with her single dad whose own archivist tendencies probably explain why these tapes were never erased/burned. A timeless time capsule for anyone who was ever a teenager or answering machine owner.\n\nSold out run at UNO Fest.\n\nDevelopment/Production support from Theatre SKAM.","times":["13th July at 6:15pm"],"venue":{"place":"2 : Tarragon Theatre Extraspace","address":"30 Bridgman AveOntarioM5R 1X3"}},{"name":"Peaches On A Cherry Tree","blurb":"Upon learning that her wife Viv has a mysterious illness, Rose decides to die by her side. But their Doctor has a different plan. “Sharpe as writer and director masterfully creates an atmosphere that is both comic and unsettling.” - NOW Magazine","times":["13th July at 8:30pm","14th July at 1:45pm"],"venue":{"place":"10 : Theatre Passe Muraille Mainspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Off The Island","blurb":"\"Off the Island\" tells the story of Stephen, a young man from the Caribbean islands. He ventures to the Great White North, where he is graced with an experience that ultimately makes him question his sexuality. This entertaining musical explores the difficult, but real experiences of the LGBTQ community of the Caribbean.\n\nThis musical explores the parallels between island and city life, while experiencing the internal struggle and hopeful triumph of Stephen, against all odds. This comedic, modern musical should no be missed.","times":["14th July at 12:30pm"],"venue":{"place":"14 : Streetcar Crowsnest Guloien Theatre","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Drink of Choice","blurb":"You walk into a bar, someone comes to take your order, and what happens next is your choice. Join us at the bar for a Choose-Your-Own-Adventure storytelling experience where the drink you order leads to personal tales about sexuality, romance, and total loss of reality. A hilarious solo show about what it means to be asexual as you navigate dating and seeking connection. \n\nPerformed by Holly Wyder\nProduced by Sarah Marchand","times":["14th July at 12:45pm"],"venue":{"place":"15 : Streetcar Crowsnest Scotiabank Studio","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Monica vs. The Internet: Tales of a Social Justice Warrior","blurb":"One Filipina. Thousands of racist internet trolls. One deep dive into the comment section. \n\nAward winning storyteller and accidental comedian Monica Ogden sheds light on activism in the age of the internet, mixed-race identity, and why white feminism is like Lays chips.\n\n“SHARP, INCISIVE, FUNNY, WELL-CONSTRUCTED, AND DEVASTATING” - Janis La Couvée\nPICK OF THE FRINGE: Bravest Show - Victoria Fringe Festival \n\n“Monica Ogden is the worst looking asian I ever saw. Filipinas are supposed to be hot, not feminist.” - Nice white man online","times":["13th July at 1:30pm"],"venue":{"place":"3 : Tarragon Theatre Solo Room","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Carpe into my DMs","blurb":"In a post-apocalyptic world, only a few millennials—and their smartphones—survive. Sketch comedy troupe, We Are Sports!, is desperate to escape the destructive mistakes of the past because this time, #thoughtsandprayers won’t be enough. With fingers pointed in all directions, will they find the answers they’re looking for, or will they be too caught up in how many Tinder matches they lost in the destruction? Directed by Second City Alumnus, Alastair Forbes, join these selfie-obsessed survivors for the best, and probably last, sketch comedy revue anyone will ever see.","times":["13th July at 4:00pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"The Autobiography of I.B.M.—Intelligent Black Men","blurb":"Beautiful People smiling in the dark!\nWhat do I ask of you?\nAn open mind that's the only prop you will need\nSoon you’ll be tripping\nNo time to pack neither Plato nor Prozac.\nHistory will be your Zen Master\nYou leave the bow\nThe target?\nYour self\nYour mission should you choose to accept: \nis to reorganize your history to make space for me\nto replace Fear: “false evidence appearing real,” \nwith: “face everything and recover.” \nEach day is a dream that is dying or one that is coming to birth.","times":["14th July at 12:15pm"],"venue":{"place":"1 : Tarragon Theatre Mainspace","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Ouvre La Porte, Ferme La Bouche","blurb":"A story of vulnerability and connection Ouvre La Porte, Ferme La Bouche is a relatable exploration of the challenges of communication directed by Kevin Vidal (Come from Away, Second City Toronto).","times":["14th July at 12:00pm"],"venue":{"place":"8 : Helen Gardiner Phelan Playhouse","address":"79A Saint George StTorontoOntarioM5S 3L8"}},{"name":"Wha' ha' happened was...","blurb":"In this stand-up comedy special, Habib and Jean share the more inane twists and turns their lives have taken. Unexpected, unmitigated, and uncensored. Who gets a Ph.D. only to do comedy and day shift at Footlocker? Who lip synchs the anthem at their naturalization ceremony? Heartbreak, immigration, and family hiccups galore. This is a show about embracing chaos, letting go, and accepting that two wrongs don't make a right, but three lefts might. See wha(t) ha(d) happened was...","times":["13th July at 7:00pm","14th July at 6:30pm"],"venue":{"place":"36 : Sarah's Cafe","address":"1426 Danforth AveTorontoOntarioM4J 1N4"}},{"name":"Night Cows","blurb":"It begins at dusk. A vachette describes her mother as she removes the shackles of the day and society, transforming herself into a sensual, grotesque, night cow. She opens herself in two, she splits herself in four, expanding into the milky way; her daughter riding her back as they go to wake the crows.\n\nNight Cows is a solo show by Quebecois Queer Indigenous artist Jovette Marchessault. MoonCow Theatre Co. has developed a fantastical interpretation that blurs the line between human and animal, mother and daughter, sky and earth, inviting audiences into the milky ecstasy of liberation.","times":["13th July at 10:15pm","14th July at 2:00pm"],"venue":{"place":"13 : Factory Theatre Studio","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Through the Bamboo","blurb":"SAVING THE WORLD, ONE GRANDMA AT A TIME.\n\nWhen Philly's Lola (grandma) dies, she finds herself in the fantastical land of Uwi. Will she be able to end the reign of the Three Sisters, find her Lola and bring her back home? \n\nInspired by Philippine mythology, THROUGH THE BAMBOO is an action-packed adventure about the value of storytelling, and how families deal with loss. A Filipinx-Canadian tale you've never heard before, told in the tradition of The Wizard of Oz, The Chronicles of Narnia and Alice in Wonderland.\n\nSuitable for kids 7+, grandparents and families.","times":["13th July at 6:15pm","14th July at 12:00pm"],"venue":{"place":"12 : Factory Theatre Mainspace","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Please Stand Clear","blurb":"Two men are waiting on a subway platform.\n\nTim is convinced that his life is about to collapse around him already. He is unsure what he wants to do, but is considering the unthinkable. Colin arrives just in time, but isn’t trying to save Tim. Colin is fascinated by death, and just wants to see Tim make his decision.\n\nContent Warning: Suicide/Self Harm","times":["14th July at 2:15pm"],"venue":{"place":"11 : Theatre Passe Muraille Backspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Omen: The Musical","blurb":"Set in a post-apocalyptic future, Omen follows a group of young witches who band together to prevent the Earth from teetering towards another disaster after detecting some mysterious human activity. The show features an original score of Pop, Rock and R&B inspired music played onstage by actors who double as the band. It’s rad, radioactive and relevant.","times":["13th July at 6:30pm"],"venue":{"place":"6 : Annex Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Into the Tango","blurb":"Award-winning dance company, PointeTango returns from Buenos Aires with INTO THE TANGO, a breathtaking new show featuring world-class dancers Erin Scott-Kafadar and Alexander Richardson. With fantastic lifts, ballet on pointe and flawless Argentine tango, this is a MUST-SEE show! Voted BEST DANCE show, 2018 Victoria Fringe  \n\nUsing traditional and contemporary music, INTO THE TANGO is the story of two dancers, lovers, and explorers who interpret the culture and drama of tango with a fresh new voice. Watch and be amazed when the graceful precision of classical ballet meets the authenticity and passion of Argentine tango.","times":["14th July at 1:45pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"the princess is the pauper","blurb":"Set after a popular people's rebellion, the fairy tale kingdom of East Enchantment is under new management, and it ain't pretty. The old magical guard is out and the mob rules. This fast-paced rollicking roller coaster of a satire shows how \"life is a mess, when you're no longer princess\".\n\nCAST: Katherine Norris, Julian Monardo, Jennifer Wren, Candi Zell, Noor Alimran, Yago Mesquita, Zenia Sethna, Victoria Brennan, Jarrod Clegg, Lianne Winterburn, and David Kovacs","times":["13th July at 2:30pm"],"venue":{"place":"7 : St. Vladimir Institute","address":"620 Spadina AveTorontoOntarioM5S 2H4"}},{"name":"Middle Raged","blurb":"Middle Raged, starring Geri Hall (22 Minutes, Second City), and Gary Pearson (MadTV, Sunnyside), is a hilarious sketch comedy that explores the ridiculous nature of life from 30 to 65, when the bloom is off the rose, but the thorns are sharper than ever. Laughs come from relatable situations and challenges, like the struggle to write your will, to spicing up the bedroom (Outlander role play anyone?). It explores child rearing in confusing modern times, financial struggles, and trying to keep your spirits up despite attending too many funerals. Ah, the joys of middle age.","times":["13th July at 2:15pm"],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"Death Ray Cabaret","blurb":"Second City veterans Jordan Armstrong and Kevin Matviw are back from the Edinburgh Fringe with a quick-witted musical comedy show that explores everything from libraries to a graveyard bash. \"Melodic arrowheads fleck’d with the Flight of the Conchords\" (Mumble Comedy). \"Our bellies hurt from laughing\" (Comedy Central UK).","times":["14th July at 6:00pm"],"venue":{"place":"21 : The Monarch Tavern","address":"12 Clinton StreetTorontoOntario"}},{"name":"Didn't Hurt","blurb":"A story about a tough upbringing, how that played out, and how to heal. Directed and dramaturged by Fringe workhorse TJ Dawe (Medicine, The Slipknot, Labrador) \n“A creative powerhouse” - Canadian Beats \n\"A heart wrenchingly rough coming-of-age story” - Vue Magazine \n“An unassuming yet mesmerizing performer.” - Winnipeg Free Press\n\"Few artists risk attempting it: turning something profoundly and deeply painful into a work of transformative beauty.” - Georgia Straight","times":["13th July at 8:30pm"],"venue":{"place":"2 : Tarragon Theatre Extraspace","address":"30 Bridgman AveOntarioM5R 1X3"}},{"name":"PUMP!","blurb":"Cat and the Queen tells a kind of bio pic story with music, storytelling and projection magic. Expect the following: closet talks, drunken cabaret music time, isolated insta stalking, Beethoven meets Britney, battle cats! and lots of Patrick Swayze. AND!!! Don't forget the music....There is lots of LIVE music. PUMP'D?! #yuuup!","times":["13th July at 6:45pm"],"venue":{"place":"10 : Theatre Passe Muraille Mainspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Philip & Lucinda Dino-Show","blurb":"Philip and Lucinda, dinosaur explorers extraordinaire, set out to understand the Paleozoic Era with song, dance and acrobatics. Philip and Lucinda may be “dino explorers” but they soon discover that their audience is filled with “dino experts” in this pre-historic adventure for the whole family. An acrobatic comedy with a whole lot of silly that leaves you saying : This show is Dino-mite! This show is suitable for ages 2-10 and anyone who loves Dinosaurs.\n\"This show T-Rocks! It’s tricera-tops! A Jurassic lark!\"- Saskatoon Star Phoenix","times":["13th July at 2:00pm"],"venue":{"place":"0 : George Ignatieff Theatre","address":"15 Devonshire PlTorontoONM5S 2C8"}},{"name":"Plum Crazy","blurb":"Welcome to the Plum Crazy Fashion Shoppe - where the staff are like family. But what happens to this family when money starts to go missing? Was it a computer error, could it be one of the customers, or did one of them break this family’s trust? Accusations abound and alliances are formed in this who-dun-it. The play examines loyalty, trust, suspicion and betrayal as the culprit is revealed.","times":["13th July at 2:45pm"],"venue":{"place":"14 : Streetcar Crowsnest Guloien Theatre","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Everything Is Fine","blurb":"Take one naïve and reckless teenager, add a desolate highway and a cold winter afternoon. The result? An incident that ripples through a lifetime. Storyteller Jennifer Martin shares tales of innocence and experience. Was she really asking for it? Are any of us?\n\n\"Simple, strong storytelling, matter-of-fact vulnerability.\" Danielle Benzon, Fringe Picks, Plank Magazine \n\"An important, quiet testimony.\" Colin Thomas, The Georgia Straight","times":["13th July at 8:30pm"],"venue":{"place":"3 : Tarragon Theatre Solo Room","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"ICARUS","blurb":"Flipping between a modern day group of friends and the world of Ancient Greece, ICARUS investigates the ways in which we are \"burned\" every day and the ways we pick each other up. Through the use of Contact Improvisation and Anne Bogart's Viewpoints technique, Arrowwood Theatre Co. aims to explore - or rather to celebrate - the loser; the failure; the loner; but most importantly - the dreamer. With impressive lifts, acrobatic tricks and a captivating movement score, ICARUS is not a show to miss!","times":["13th July at 5:45pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Destiny, USA","blurb":"From the creator of hit solo shows Pitch Blonde and The Homemaker! When Laura moves from Toronto to Syracuse, New York, she wasn’t expecting to be residing in Trump’s America. Gaining her first job as a relay operator for the Deaf and Hard of Hearing causes her to question if she can discover the hidden humanity of the American people. This production integrates ASL video performance featuring three Deaf actors, and closed captioning. \"If you are searching for a relief from modern cynicism and despair, look no further than Destiny U.S.A.” - The UBYSSEY","times":["13th July at 5:00pm"],"venue":{"place":"15 : Streetcar Crowsnest Scotiabank Studio","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"TIL DEATH: The Six Wives of Henry VIII","blurb":"The Betrayed Wife. The Scheming Wife. The Peacemaker. \nThe Ugly German. The Tarty One. \nThe One in Love with Someone Else.\nSix Queens. Six Love stories. Six Deaths. One Actor! One Award-Winning Experience! “... one of the most impressive acting feats in the festival!” ★★★★★-Kevin Prokosh, Winnipeg Free Press\n“A standing ovation followed Travis’ tour-de-force performance.”- ★★★★★ London Free Press\n“Tara Travis is an immense talent. Go see this show and find yourself in Heaven. Comedy Heaven, that is.” –umfm.com “What more can I add? WOW!” ★★★★(out of 4)- The Beat, London","times":["13th July at 10:15pm"],"venue":{"place":"1 : Tarragon Theatre Mainspace","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Becoming Magic Mike: An Action Adventure Comedy","blurb":"Comedian DK Reinemer (Help! I’m American, The DK Effect) presents his smokin’ hot, action adventure comedy about a detective thrust deep undercover in the unfamiliar world of male stripping . He’s undercover, underdressed, and over the top. Can he pull it off?\n\n“Cool As A Cucumber Award” - Orlando Fringe 2018\n“Outstanding Artist Award” - Calgary Fringe 2017\n“Spirit of the Fringe Award” - Montreal Fringe 2017\n“Four Stars” - VUE Magazine","times":["14th July at 4:00pm"],"venue":{"place":"8 : Helen Gardiner Phelan Playhouse","address":"79A Saint George StTorontoOntarioM5S 3L8"}},{"name":"The Worst: a DoFo inspired musical","blurb":"A and G are two social justice lawyers trying to make their way in a Doug Ford world. Things are grim, but not all hope is lost when drag, Cats (the musical and animal) and a tickle trunk full of possibilities show a path to resistance. Join them for a cabaret of sorts, including musical theatre rip-offs, (attempted) jokes, complaining, and more! This could be horrible; fittingly, it's The Worst.","times":["13th July at 9:45pm"],"venue":{"place":"11 : Theatre Passe Muraille Backspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Pack Animals","blurb":"Ever been to summer camp? Took a shit in the woods and wiped using pages from your guidebook? Speared the patriarchy on a hot dog stick and toasted over a roaring fire? After getting lost in the woods, a multi-badged Woodpecker and a wildernessly-inept Beaver must set aside their differences to find their way home. JOIN US for an adventure through the untamed forest of sex, puppets, bushcraft...and campfire songs! BEST OF VENUE and CRITIC'S PICK (Nutrien Fringe 2018).","times":["13th July at 2:45pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"The Peers","blurb":"Oh, a Shakespeare aficionado, are you? \n\nNo matter how you answered that, you're gonna love what we are putting down. \nThe Peers bring timeless tales into the modern mindset, with all of the tropes, costumes, and tomfoolery you'd expect. Representing every single one of the Bard's plays in an hour is no easy feat, and we are NOT the experts for the job. Like, not even close. \nBut, we are here. And we will do it. For the show...it must...go...\n\non.","times":["13th July at 8:15pm"],"venue":{"place":"6 : Annex Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"The Ashes of Forgotten Rain","blurb":"It's opening night and the dressing room isn’t big enough to contain all the egos. Tensions are high as long-standing grudges come to a head and the cast and crew become aware of their role in it all. What Fringe experience would be complete without a pretentious tale of comedy, romance, and the triumph of the human spirit?\nWriter/Director: Norman Hussey\nProducer: Leila Bannister\nDramaturg: Pamela Barker\nStage Manager: Skye Ashby\nArt Director: Mike Argue-Greene\nCast: Jennifer Fahy, Laura Mannion, Christine Cortes, Cam Parkes, Katie Scharf, Atticus Raife","times":["13th July at 7:30pm","14th July at 12:00pm"],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"Old Fart","blurb":"Hilarious, Touching and Fun. Old Tom is a quirky Old Fart who will take you through the joys and challenges of living long, laughing hard and loving deeply. Stories, jokes, songs, tears and laughter. He’s everyone’s Granddad with a twist... He’s actually funny! Young or old, you’ll love him. Just don’t pull his finger.\nWinner: 2017 London One Act Festival’s People’s Choice and Best Actor Awards, nominated Best Comedy, Brickenden Awards, 2018. He’ll bring a smile to your face, a tear to your eye and a song to your lips. Catch the “Old Fart”. See why it’s a People’s Choice.","times":["13th July at 8:30pm"],"venue":{"place":"12 : Factory Theatre Mainspace","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Herbeaver","blurb":"Herbeaver is an all-female sketch-comedy troupe that formed in 2017 by Heather Gallant, Mallory Morgan, and Katie Preston. Their style of comedy ranges from total absurdity to calculated social commentary. They indulge in mocking the world around them at every opportunity, using musical comedy, satire, and absolute idiocy; and they always keep it fast-paced, feminist, and in your face. Audiences have said, “[They are] hilariously inappropriate!”, “I can’t believe they wrote that themselves!”, and “We get it! You can do a lot of sketches!”","times":["13th July at 2:45pm"],"venue":{"place":"13 : Factory Theatre Studio","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"American Christian","blurb":"After winning \"Best Comedic Performance\" at the 2018 Boulder Fringe Festival for her biting stand-up comedy, Elaine is now taking the pulpit. Her brand-new satirical service skewers the trends in American churches. Also snacks.","times":["13th July at 6:30pm"],"venue":{"place":"7 : St. Vladimir Institute","address":"620 Spadina AveTorontoOntarioM5S 2H4"}},{"name":"Scadding","blurb":"Grab your headphones and favourite pair of shoes for this walkabout audio play. Produced with binaural audio recording, including sound effects and music, 5 mini plays bring to life the hidden, hilarious life of Scadding Court. This immersive audio experience bursts open the box of radio drama, bringing you right to where the story happens. Armed with a map and some helpful guides, find your own play while exploring the world of Queen and Bathurst.","times":["13th July at 2:00pm","13th July at 4:00pm","14th July at 2:00pm","14th July at 4:00pm"],"venue":{"place":"25 : Scadding Court Community Centre","address":"707 Dundas Street WestTorontoOntario"}},{"name":"Cyrano de Bergerac","blurb":"Cyrano, Christina, and the Comte de Guiche vie for the affection of Roxanne, one using their wit, another their beauty, and the third . . . well any trick in the book. In the tradition of street theatre of the past, The Leslieville Players invite you to lay back on a patch of grass and watch us barrel through this new family friendly adaptation of a beloved classic. Sure Shaw and St. Lawrence are doing the show too, but we're more fun! (and cheaper.)","times":["13th July at 2:00pm","13th July at 4:00pm","14th July at 2:00pm","14th July at 4:00pm"],"venue":{"place":"33 : 74 Jones Ave","address":"74 Jones Ave,TorontoOntarioM4M 2Z8"}},{"name":"Boy Falls From The Sky: Jake Epstein Live at Supermarket","blurb":"He's been \"that guy from Degrassi\", then starred on Broadway in Beautiful and as Spider-Man. Not bad for a kid who dreamed about performing on Broadway in the backseat of his parents’ minivan on their annual family road-trip to NYC. But the thing about dreams is, they don’t always go as planned. Through a series of funny and revealing stories and songs, from touring the US, to enduring steroid shots and Broadway Boos, Epstein shares the rejection, stage fright and heartbreak behind a seemingly successful career in this showbiz tell-all. For anyone who’s ever tried to go after their dreams.","times":["13th July at 7:00pm"],"venue":{"place":"22 : Supermarket","address":"268 Augusta Ave,TorontoOntarioM5T 2L9"}},{"name":"Sarah and Lucy","blurb":"This Girl Comedy was inspired by the acclaimed series, these Trailer Park gals, Sarah and Lucy  speak up ! Yeah, that's right! We got something to say! But how do all these big changes impact their frienship? \n\nExperience this profane show and discover the hidden \"behind the scenes\" story of Sarah and Lucy. Featuring Nicole Fairbairn and Irena Huljak","times":["14th July at 4:15pm"],"venue":{"place":"2 : Tarragon Theatre Extraspace","address":"30 Bridgman AveOntarioM5R 1X3"}},{"name":"The Knitting Pilgrim","blurb":"THE KNITTING PILGRIM is a one-act play performed by fibre artist/actor Kirk Dunn, and tells the story of his 15-year artistic and spiritual journey knitting Stitched Glass: three large tapestries, designed in the style of stained glass windows, exploring the commonalities and conflicts of the Abrahamic faiths. Kirk's hope behind The Knitting Pilgrim has always been to create conversation. \n\nThe journey is a story you’ll want to experience – there is no other project like it in the world.","times":["13th July at 7:00pm"],"venue":{"place":"20 : Bloor Street United Church","address":"300 Bloor St WTorontoOntarioM5S 1W3"}},{"name":"Gremlin Hour","blurb":"All Gremlins, including you, are invited to a meeting of gremlins. The child we have to scare is asleep all the time. It’s hard to be spooky when they don’t want to be awake. We need your help! What is a Gremlin to do?! Please meet in Hazel’s bedroom. There is lots of room but only one closet to hide in. We promise there’s no spooking at the meeting and we will have Gremlin Pizza. For Ages 6-12. \n\n*Note: Gremlins do not know what Pizza is.","times":["13th July at 10:30am","14th July at 4:15pm"],"venue":{"place":"0 : George Ignatieff Theatre","address":"15 Devonshire PlTorontoONM5S 2C8"}},{"name":"Palabra Flamenco: Fox Woman","blurb":"A lonely hunter meets a mysterious and powerful fox woman. Before the West cultivated hatred of the wild, there was a love affair. Flamenco artists, dancer Denise Yeo and guitarist Gareth Owen, retell this Siberian myth through hypnotic and improvised speech and rhythm.\n\n“There’s virtuosity to burn... Owen plays like he has a hundred fingers... Let it wash over you.” The Georgia Straight\n\n“Yeo is a spitfire, uncontainable in her passionate delivery, staccato feet blurring in ferocious movement.\" Janis La Couvée, theatre reviewer","times":["13th July at 1:30pm"],"venue":{"place":"15 : Streetcar Crowsnest Scotiabank Studio","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Improvised Therapy","blurb":"Have you completely and utterly lost the will? No? Well, we have. We're doctors Barry, Brian and Bean, and we've come all the way from the U.K. to be your (un)qualified therapists. \nThis session will include; daddy issues, self-deprecation, no actual medicinal help and lots of unfulfilled expectations. If this sounds like it'll be of absolutely no help to you, fantastic! That's all part of the treatment.\nImprovised Therapy is an absurdist comedy exploring the weight of people's problems and how to live when you've lost the will.\n*Shortlisted for the BWW Edinburgh Fringe Favourite Comedy Show Award 2018*","times":["14th July at 6:15pm"],"venue":{"place":"3 : Tarragon Theatre Solo Room","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"I Christopher","blurb":"I Christopher deals with the struggles of finding and maintaining a job with our lead character Christopher who is on the Autism spectrum. The struggle also goes into depth in asking questions such as what’s his role society? What can he contribute? Can he be loved or accepted in a world that’s moving too fast for him to catch up? Christopher is played by Claudio Tamburri, who has not only written this production but is making his Toronto debut at the 2019 Fringe. Claudio writes from his own experience as a man on the autistic spectrum. Moving, frustrating, and edgy,","times":["13th July at 7:30pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Ether","blurb":"Stranded in the unknown space between life and death, a shocking secret has come to light. Join the cast of ‘Ether’ on an unsettling journey from this realm into the beyond, where past mistakes come back to haunt us. In a room with no entrances or exits, the characters must navigate the defining moments of their lives, but can they outrun their shame forever? Exploring the relationship between morality and the afterlife, ‘Ether’ unites an unlikely group of women to confront the betrayal and inaction that may have cost them their lives. Perhaps they can brave this limbo together.","times":["13th July at 2:45pm"],"venue":{"place":"8 : Helen Gardiner Phelan Playhouse","address":"79A Saint George StTorontoOntarioM5S 3L8"}},{"name":"Failed","blurb":"The play is not a docudrama, although it is built from the reality of the life of a former drug addict, clean now for 5 years. . He lives in an apartment on King Street in Toronto right where I cross the cross walk to the park where I walk my dog twice a day. I say hello to everyone, and this is how we met. Xander began walking with me and began telling me about his life, which I soon realized was his drug life. I learned at the time that he was in CAMH and had been clean for a year.","times":["14th July at 5:45pm"],"venue":{"place":"10 : Theatre Passe Muraille Mainspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Escape from Shady Acres","blurb":"Shirley is the newest resident of Shady Acres. She has escaped two retirement homes before and plans on making Shady Acres her third. The manager won’t make it easy. Shirley will have to learn how to sing, dance and make friends if she wants to escape from Shady Acres. \n\nJuly 3 6:45 PM July 5 10:00 PM July 6 8:15 PM July 7 3:00 PM\nJuly 9 4:00 PM July 11 6:00 PM July 13 12:30 PM","times":["13th July at 12:30pm"],"venue":{"place":"1 : Tarragon Theatre Mainspace","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"High School High","blurb":"Multi award-winning show High School High makes it’s Toronto debut from Toasted Theatre’s Alli Harris. \n\nDirected by Canadian Comedy Award Winner Al Connors, comes a solo-musical-comedy about how much high school freakin’ SUCKS, MAN.\n\nWINNER: Emerging Artist (Prix Rideau Awards, 2018)\nWINNER: Outstanding New Creation (Prix Rideau Awards, 2018)\n\n“This solid hour of non-stop musical comedy that kills right to the final note ... don’t wait til Harris costs ten times as much to see I’m sure it won’t be long. “ APT 613","times":["13th July at 6:15pm"],"venue":{"place":"13 : Factory Theatre Studio","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"The Weight of It All","blurb":"Comedian Gillian Bartolucci balances the pressures of diet culture, fertility issues, and the ongoing struggle for self acceptance through full bodied comedy, characters, truths, songs, dance and fibroids. The Weight of It All is a mission to find value and humour in the things that cannot be measured with a scale. \n\nGillian is a member of the Canadian Comedy Award-winning sketch collective The Sketchersons. She has performed in the Just For Laughs festival (Rapp Battlez), JFL42 (Rapp Battez, and New Faces: Character Showcase) and both Toronto and Montreal (Best of the Fest) Sketch Comedy festivals.","times":["13th July at 4:30pm"],"venue":{"place":"11 : Theatre Passe Muraille Backspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"News Play","blurb":"After botching a major publishing deal, two estranged children's book writers return to their hometown to revitalize the local newspaper. From the best-selling, award-winning losers behind 2018 Patron's Pick, “Everyone Wants A T-Shirt!,” and “Madeleine Says Sorry,” comes a new comedy about fake news, self-improvement and a home printer named Stanley.\n\nPraise for Prairie Fire, Please: \n\n“Exuberant, absurdist and smart...a great find!\" - My Entertainment World (A- Letter Score)\n\n\"This smart, funny, and unpretentious comedy about the perils of chasing success is just what we need.\" - Kendra Jones","times":["13th July at 12:45pm"],"venue":{"place":"6 : Annex Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"i feel you","blurb":"The most passionate can be the most toxic. The deepest pain can be the sweetest pleasure. A dance theatre investigation into the complexity of human connection. With a combination of choreographed and experimentally-devised movement, performers connect through love & passion, control & power, desire & guilt, jealousy & addiction.\n\nFrom the company behind EVERYDAY OPPRESSIONS (\"NNNN - A visually stunning contemporary dance piece...expertly executed!\" - Now Magazine), INFINITUM (\"NNNN - Critic's Pick! The depiction of the universe's unlimited differentiation DAZZLES.\"- Now Magazine) and the Internationally Acclaimed UNICORN HORNS (\"NNNNN - A MUST see.\" - Now Magazine).","times":["13th July at 8:30pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Untitled No. 7","blurb":"Are you a success? How do you know? If you’ve ever woken up in the middle of the night worrying about what you’re doing with your life, then this joyously ridiculous fairy tale is for you. A wild adventure exploring the curse of potential and the holy grail of success, chock-full of pop culture poetry, punk rage and a healthy dose of interpretive dance. \n\n“Extra bloody amazing. A fractured fairy tale so fierce and fabulous that you might actually start believing in yourself” Sometimes Melbourne\n\"A performance from someone at the top of their game\" Arts Review","times":["14th July at 5:00pm"],"venue":{"place":"7 : St. Vladimir Institute","address":"620 Spadina AveTorontoOntarioM5S 2H4"}},{"name":"Fuckboys the Musical","blurb":"Karaoke night, every Wednesday, with your best friends in the world. What could possibly mess that up? You guessed it: fuckboys. An epidemic truly sweeping the nation, fuckboys are \"literal garbage and must be stopped!\" In this hilarious one-act musical, four women will teach you the skills you need to take down the post dangerous predators in today's modern dating scene. Fuckboys is a musical extravaganza you WON'T want to miss!\n\n\"Sharp and Funny\" Orlando Sentinel \n\"Broadway-worthy\" Orlando Weekly \nVoted Critics' Choice Best Musical Orlando Fringe 2018\nBest Musical at the 2018 Tampa Theatre Festival","times":["13th July at 4:30pm"],"venue":{"place":"14 : Streetcar Crowsnest Guloien Theatre","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Checkpoint 300","blurb":"Checkpoint 300, this year’s winner of the Fringe’s First Play Competition recounts the story of a tragic incident at the Israeli-Palestine border fuelled by fear and the ongoing conflict between the two sides. Using a female driven narrative, the play examines the lives of two families, how borders provoke violence and challenges us to reflect on our own humanity in wake of tragedy.\n\nThe New Play Contest is generously supported by the Aubrey and Marla Dan Charitable Foundation.","times":["13th July at 10:15pm","14th July at 4:00pm"],"venue":{"place":"12 : Factory Theatre Mainspace","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Drama 101, A New Musical","blurb":"When the students of Roselawn High School gather to celebrate the retirement of their favourite teacher, memories are shared, rivalries surface, and love blossoms. Featuring a cast of young artists ages 13-19, Drama 101 is a funny and heartwarming new musical about the joys and challenges of high school, theatre, and life.","times":["13th July at 9:15pm","14th July at 5:45pm"],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"Mayhem at Miskatonic: A Burlesque Mystery Game","blurb":"Answer the Call of Cthulhu and be teased, titillated, and a touch terrified by our Lovecraft-inspired Burlesque Mystery Game!\n\nThis 90-minute show is an immersive tale of unleashed demons and unbuckled britches. Audience members are invited to choose the direction of the plot to save our souls or plunge the world into demonic darkness.... No pressure.","times":["13th July at 2:00pm","14th July at 2:00pm"],"venue":{"place":"23 : The Painted Lady","address":"218 Ossington AvenueTorontoOntario"}},{"name":"The Commandment","blurb":"What would you do if you found out that God had chosen you to deliver His newest commandment? What if you didn’t believe in God? His life in shambles, unwilling to be the mouthpiece for a god he refuses to believe in, Thomas crashes an open mic night to tell his story.\n\n\" A roller coaster...\" - Grid City Magazine\n\"Phil Rickaby has commanding stage presence and storytelling prowess.\" - TWISI Theatre Blog\n\"A well-crafted story with surprising emotional impact.\" - Monkeybiz.ca","times":["13th July at 1:00pm","14th July at 6:00pm"],"venue":{"place":"2 : Tarragon Theatre Extraspace","address":"30 Bridgman AveOntarioM5R 1X3"}},{"name":"The Taming of the Shrew","blurb":"There are plenty of suitors for Baptista's youngest daughter Bianca, but access to her is cut off until they can find a husband for the older and sharp-tongued Kate. Come enjoy an outdoor romp of Shakespeare's take on the classic folktale. Audience will follow the action in and around the courtyard of St. George by the Grange.","times":["13th July at 2:00pm","14th July at 2:00pm"],"venue":{"place":"28 : St. George the Martyr Courtyard","address":"197 John Street,TorontoOntarioM5T 1X6"}},{"name":"Beneath the Bed","blurb":"In the aftermath of a trauma, a young child meets a monster living under their bed and together they discover through searching the stars that this too will pass. An exploration of childhood and imagination, grief and loss, Beneath the Bed is a twisted tale exploding with music, wit, heart, and joy.","times":["13th July at 3:30pm","14th July at 2:00pm"],"venue":{"place":"26 : Scadding Court Community Centre, Room 4","address":"707 Dundas St W,TorontoOntarioM5V 3A8"}},{"name":"Dungee the Dragon & The Just-Okay Juggler","blurb":"Stories by Dan takes you (with artistic license!) back to the Middle Ages where the Kingdom of Awesome is under attack by a sassy non-fire-breathing dragon! The King calls on the Great Knights to save the day, but somehow the job falls on a lonely juggler who must learn to handle three swords (at the same time!) to defeat the dragon. With light-hearted humour, a dragon puppet with attitude, and a knife juggling act, this original story will bring laughter and fun to all! NOTE: Optional seated audience participation (like creating sounds with hands and/or feet). Suitable for ages 4 - 12.","times":["14th July at 12:45pm"],"venue":{"place":"0 : George Ignatieff Theatre","address":"15 Devonshire PlTorontoONM5S 2C8"}},{"name":"Nerves","blurb":"After the sudden death of her grandfather, a young woman learns to juggle her own life with her new found responsibilities as the primary caregiver for her mother, who struggles for her own independence as her multiple sclerosis progresses. \nNerves is a story of love, family, and dignity— and a reminder that if a woman with a cane says she doesn’t want your help climbing the streetcar steps, she doesn’t want your help.","times":["14th July at 6:00pm"],"venue":{"place":"15 : Streetcar Crowsnest Scotiabank Studio","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Congratulations!","blurb":"\"Congratulations!\" is a story of achievement, embarrassment, and self-worth told through the milestones of comedian and multiple limb amputee Courtney Gilmour. From childhood to present day Courtney explores the common thread between her wins and losses, reveals the lows of insecurity and depression while at the height of success, and shares her bumpy journey towards finding self-love. As she navigates emotional meltdowns in McDonald's to a mortifying encounter after buying a cat stroller, Courtney uses a variety of humorous and heartfelt experiences to share what \"congratulations!\" accolades really mean to her.","times":["13th July at 5:00pm","14th July at 2:45pm"],"venue":{"place":"3 : Tarragon Theatre Solo Room","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Tita Jokes","blurb":"Meet the Spice Girls of Comedy with a Filipina Twist. They sing, they dance, and they’re going to make you snort-laugh halo-halo through your nose! Join the Toronto SketchFest 2019 Producers' Pick winners, the Tita Collective, for a musical sketch comedy spectacle to remember. TITA POWER!","times":["14th July at 6:00pm"],"venue":{"place":"1 : Tarragon Theatre Mainspace","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Swallowed Whole","blurb":"Picture this: a sketch series that draws from absurdist images of socio-economic issues, isolation, and fragile privileged entitlement, with the comedic wit behind \"Mating Rituals\" from last year's Toronto Festival of Clowns.\n\n3 actors, 20 characters, 3 bad celebrity impressions, 3 songs, 55 minutes, 1 is the loneliest number, 4+2=7. Rachel Parry brings her unique style to the stage for the first time in this collection of peculiar sketches, featuring three of Toronto's most axolautlomatic performers!","times":["13th July at 6:45pm","14th July at 8:00pm"],"venue":{"place":"8 : Helen Gardiner Phelan Playhouse","address":"79A Saint George StTorontoOntarioM5S 3L8"}},{"name":"Allegra & Serena present: Twinsations","blurb":"Allegra and Serena Shanazarian were gonna be the biggest twin child stars of the ‘90s, that is, until Mary-Kate and Ashley Olsen swooped in and stole their dreams. This is the True Hollywood Story of two sisters who just can’t let go of the past, and the lives slash careers slash fame slash fortune that could have been theirs...you think you know, but you have no idea.","times":["13th July at 6:15pm","14th July at 12:30pm"],"venue":{"place":"11 : Theatre Passe Muraille Backspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Petroleum: A Triptych","blurb":"Petroleum is an hommage to self-loathing narcissism; a celebration of our violent DNA; a unique basic poem; a social dance between pain and pleasure. \nLewis's interest in the concept of general effect comes from her implication in the marching arts. The competing shows are evaluated for their emotional, visual and intellectual effects. While we do not believe in the idea of grading a piece of art, we wonder how the goal of effectiveness in our communication translates to our audience. We're not ashamed to say that we hope to offer a solid, moving, memorable show.","times":["13th July at 1:00pm"],"venue":{"place":"14 : Streetcar Crowsnest Guloien Theatre","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Who You Callin Black Eh?","blurb":"Enter Our Heroine's bi-racial, multi-racial, post-racial Eh? world of 2019.\nWho You Callin Black Eh? is a coming of age play set in Canada’s largest, most multicultural, multilingual city, that is not about sexuality, but is about colour. \nWherever Our Heroine goes, whatever she does, with whomever she relates, she is not Black Enough or White Enough to find her people. Shadism causes her to be shunned.","times":["14th July at 12:15pm"],"venue":{"place":"13 : Factory Theatre Studio","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"It Girls","blurb":"Fifteen years after their dramatic split, the It Girls are back for the biggest girl group reunion of the year! But can the band put their issues aside and just focus on the music? The answer is no. 100% no.\nA comedy-musical featuring some of Toronto's funniest comedians, \"It Girls\" has it all - fame, friendship, forbidden romance, girl power, camp, Showgirls-esque sabotage, and a hilarious collection of original early 2000s-inspired pop songs.","times":["13th July at 12:30pm"],"venue":{"place":"12 : Factory Theatre Mainspace","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Comedy Records Presents: Jay & Eytan","blurb":"Jay & Eytan are a New York based professional comedy duo, originally from Canada. They showcase a perfect blend of sketch and stand up comedy in their one hour headlining act - packed with energy, countless punchy premises, and just the right amount of spice. Jay & Eytan bounce from quick off beat impressions, to honest & relatable stand up, to fully choreographed musical numbers, going right for the jugular when it comes to the laughs. So kick back, have a drink, and get ready for a full on ab workout.","times":["13th July at 4:30pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Every Silver Lining","blurb":"Every Silver Lining is an original, dramedic, coming-of-age musical about illness and the perseverance of life; juxtaposing the joyful naiveté of youth, and the crushing discovery of mortality.\n\nShow dates & Times: \n\nJuly 4th, 8:15pm \nJuly 6th, 9:15pm\nJuly 7th, 1:00pm\nJuly 9th, 6:15pm\nJuly 10th, 2:45pm\nJuly 11th, 5:15pm\nJuly 13th, 1:45pm\n\nCast: Taha Arshad, Joel Cumber, Daniel Karp, Dale Miller, Alison J Palmer, Laura Piccinin, Jada Rifkin, Ben Skipper, Sara Stahmer, Allison Wither\n\n*Image by Golden Legacy Design*","times":["13th July at 1:45pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Moving On","blurb":"Kyle’s apartment is neat and organized. Also his life. But today, not so much. The bag of limes? It’s gone. The potted plant? It moves. His ex-girlfriend? She hides. She hides from Kyle's new girlfriend. She hides from her brother, whose traditional grow-op faces the challenge of legal cannabis. Meanwhile Kyle’s new girlfriend has found a wealthy investor for his über-cool software concept. Problem: the investor got wealthy by bankrupting Kyle’s home town. Trust and betrayal in Ontario’s brave new economy. A rom-com. Set Designer: Sam Bradbury. Fight Director: Neil Adams. Photography: Dahlia Katz.","times":["14th July at 3:30pm"],"venue":{"place":"10 : Theatre Passe Muraille Mainspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"King Stag","blurb":"King Deramo’s search for a wife is undermined by the evil prime minister Tartaglia, who tricks the king into transforming himself into a stag, while Tartaglia transforms into the king. Mayhem ensues, and paranoia threatens to unravel the whole kingdom, but love emerges triumphant in this riveting and hilarious commedia dell’arte classic.","times":["13th July at 10:00pm","14th July at 3:45pm"],"venue":{"place":"6 : Annex Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Squeeze My Cans","blurb":"A true story “Surviving Scientology” Told with masterful fluidity and hilarious jabs, this solo show takes you down the “rabbit hole” that is SCIENTOLOGY. In 73 minutes Schenkelberg shares her journey looking for place and purpose in the world. Hilarious, heartbreaking and redemptive. Lets you experience for yourself how Scientology devours money and lives.Pick of the Fringe EDINBURGH, Hollywood,Calgary, Vancouver, ADELAIDE, Tampa. Mature 13 and above.","times":["13th July at 10:00pm"],"venue":{"place":"7 : St. Vladimir Institute","address":"620 Spadina AveTorontoOntarioM5S 2H4"}},{"name":"Above & Beyond","blurb":"Welcome to Bright Star Tours, a travel company where every student shines! In this relatable workplace comedy, best friends Jamie and Nicole will have to outshine macho coworkers and navigate office politics just to survive their dead end job. Will they persevere against every millennial’s worst nightmare or drown under a pile of unread emails?\n\nSet & Costume Designer: Jules Mendoza\nLighting Designer: Sharmylae Taffe-Fletcher\nSound Designer: Frank Incer","times":["13th July at 4:00pm"],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"Lexi and the Flying b's","blurb":"Lexi is eager to enter a project in the school science fair, but she needs a great topic, a willing partner, and strategies to deal with her dyslexia. Yaya, Lexi's grandmother, has a sister back in Cyprus who is about to have surgery, and Yaya desperately wants to see her. How can these two help each other to get what they need? Best suited for ages 5 to 10.","times":["13th July at 3:45pm"],"venue":{"place":"0 : George Ignatieff Theatre","address":"15 Devonshire PlTorontoONM5S 2C8"}},{"name":"Mice at Centre Ice","blurb":"Will Benny the Bullet and the Mouse Hockey Leaguers get the Cheddar Cup back from the Rink Rats? What dangers await brave Benny? Can any of them be worse than the steel blades of the Zamboni machine? And will the legendary but reclusive retired star \"The Big M\" make a triumphant return to the game he loves? Based on a beloved best-selling children's novel from the 1980s that also became an animated film. All proceeds from this show will be donated to the Lawyers Feed the Hungry Program in Toronto. Suitable for hockey fans and children ages 5-12.","times":["13th July at 5:30pm"],"venue":{"place":"0 : George Ignatieff Theatre","address":"15 Devonshire PlTorontoONM5S 2C8"}},{"name":"Closet Confessions: The Secrets of a Hot Mess","blurb":"Closet Confessions: The Secrets of a Hot Mess is a one-man show starring\ncomedian and actor Patrick Cadegan. With sass and dramatics, the show hilariously\nexplores coming out of the closet, living with mental illness, and life as a hot mess. Not\nyour traditional one-man show, this dynamic presentation also features stand-up\ncomedy, original characters, and shocking surprises! \"Closet Confessions: The Secrets of a Hot Mess\" premeired at The Halifax Fringe Festival in 2018 to sold out audiences, and standing ovations!","times":["14th July at 4:00pm"],"venue":{"place":"11 : Theatre Passe Muraille Backspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"In Waking Life","blurb":"Do you seek the answers to your future? The meanings of your dreamings? The Synsk Sisters are here to help you with all of your problems, and answer all of your questions! (*NOT A SCAM*)\n\n“Wild, high energy, and intimately memorable” -Showbill.ca\n“Side-splittingly funny”, “A cavalcade of non-stop action” -Apt 613\n“I’m declaring ‘In Waking Life’ to be the Hidden Gem of the Fringe!” -Chris Gabel, improviser with Paper Street Theatre Co.\n\nWINNER: ‘Spirit of the Fringe’ award, Kingston Fringe 2017","times":["13th July at 8:30pm","14th July at 2:30pm"],"venue":{"place":"15 : Streetcar Crowsnest Scotiabank Studio","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Get Better","blurb":"Life changing concussions aren’t just for football players. What happens when a busy perfectionist bumps her head too many times? Get Better is a quirky, and dark look into the emotional journey of recovering from a minor traumatic brain injury. Using narrative and physical theatre, \"Get Better\" reveals the uncomfortable truths about living with invisible injury. This mostly true story explores how this common injury effects relationships, and identity. Co-produced by Buzzkill.","times":["13th July at 10:15pm","14th July at 4:30pm"],"venue":{"place":"3 : Tarragon Theatre Solo Room","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"THE BIG HOUSE","blurb":"When you’re a little kid and your Dad goes to jail, does a part of you go with?\nFringe favourite Tracey Erin Smith is back in her most personal show yet.\nIn 2018 when she finds herself in California's Kern Valley maximum security men’s prison, as a Dragon’s Den type judge, it’s an unlikely place for a heart to heal. \nPast Shows: Best of Fringe in Toronto & New York City. Critic's Pick, BACKSTAGE Magazine, NYC\n\"Tracey Erin Smith has the art of entertainment refined to the point of hypnotism.\" -Eye Magazine","times":["13th July at 2:15pm","14th July at 7:30pm"],"venue":{"place":"12 : Factory Theatre Mainspace","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"The Trophy Hunt","blurb":"Go on a hunt to stalk something wild and dangerous... you just might find it. \nParker has waited his whole life for this trip. Jan follows this same path and makes this same trip every day, she doesn’t have a choice. Soraya wishes they’d all leave her alone on her beach vacation.\nThe Trophy Hunt is an exploration of who eats who in our canned hunt of a world where everything is observed, everything a zoo.\nThis intimate, roving production takes a maximum of 25 audience members per show on a safari in the heart of Toronto.","times":["13th July at 6:00pm","13th July at 7:00pm","13th July at 8:00pm","13th July at 9:00pm","13th July at 10:00pm"],"venue":{"place":"27 : 401 Richmond","address":"401 Richmond St WTorontoOntarioM5V 3A8"}},{"name":"Three Men on a Bike","blurb":"From the company that brought you the award-winning Toronto Fringe smash hit Three Men in a Boat. Based upon the further writings of Victorian author Jerome K. Jerome. Pea Green Theatre Group proudly presents Three Men on a Bike! (Being the further adventures of three Victorian gentlemen as they embark upon a disastrous bicycling trip to the continent.) Not to be missed!","times":["13th July at 8:00pm","14th July at 2:00pm"],"venue":{"place":"1 : Tarragon Theatre Mainspace","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Be Kind, Rewind","blurb":"Judy Blume meets High Fidelity in this funny and heart-warming coming-of-age story written by Barbara Johnston and Suzy Wilde, two of Toronto's most prolific emerging musical theatre writers. When fifteen-year-old Deirdre and her younger sister Dawn are sent to live with their cousins in Tortoiseshell Lake in the summer of 1995, Deirdre gets a job at the local video store where she finds her voice and falls in love with movies. This is a staged reading of a new musical work from the creative team that brought you Summerland and One Small Step.","times":["14th July at 7:00pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Heart of Matter","blurb":"Heart of Matter is a meditation on memory and the special artifacts that spark recollection. It is dedicated to objects we keep or forget. This whimsical and poetic dance-theatre work reflects on feelings of opening and closing, and the human experience of holding on, or letting go. \n\nHeart of Matter was originally developed as a commission from the Ryerson School of Performance for Springworks 2019. Thanks to the original cast of dancers, Vicki St Denys, and the production team (including Kathleen Preston, Arun Srinivasan, Piotr Mrugacz), for their ongoing support and inspiration.","times":["13th July at 9:30pm"],"venue":{"place":"19 : Trinity-St. Paul's United Church Gym","address":"427 Bloor Street WestTorontoOntarioM5S 1X6"}},{"name":"Searching for Marceau","blurb":"'Searching for Marceau' finds a budding young Mime trying to make sense of his two fathers: the real one raising him and the far away Marcel Marceau. The imaginary and the real battle in this coming of age theatre/mime piece that reinvents Marcel Marceau’s Mime tradition for the 21st Century. \n\nPerformer Trevor Copp studied at the Marcel Marceau school in Paris and developed this work for 6 years to take Mime - a thing stuck in a box, in a park, in the 70s - and reinvent, renew, and return this form to contemporary audiences.","times":["13th July at 4:30pm","14th July at 12:45pm"],"venue":{"place":"2 : Tarragon Theatre Extraspace","address":"30 Bridgman AveOntarioM5R 1X3"}},{"name":"the astrology play","blurb":"Mercury’s going retrograde again and we are dreading it! On July 7, 2019, — right smack in the middle of the festival — the planet of organization and communication goes backwards opening us all up to slip ups, confusion, and sticky situations. LOL! Have you ever tried putting up a play during a time when everything’s meant to go wrong? Ever wanted to see a show about Mercury going retrograde right as Mercury goes retrograde? Hate astrology, but interested in paying to see a show about it anyway? Then my, stars, do we have a show for you!","times":["13th July at 5:00pm","14th July at 12:00pm"],"venue":{"place":"10 : Theatre Passe Muraille Mainspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Sweet Kisses - Tender Limbs","blurb":"\"Do I think I’m a good mother? Yes. Could I be better? No.\"\n\nA collection of opinions on motherhood, spanning from the undeniably beautiful to the frighteningly hopeless. A story of a woman and her journey through the early stages of motherhood and her lonely battle against a nameless horror within, told through recorded interviews, poetry, song, clown and conversation.\n\nSpecial Contributor: Lidia Foote as Production Manager, Sound, Lighting and Projection Design","times":["13th July at 2:45pm","14th July at 5:45pm"],"venue":{"place":"11 : Theatre Passe Muraille Backspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Young and the Limbless","blurb":"Jenna, a multiple amputee, is tired of her role as a \"token\" hire at a local magazine. She lives with a disability but comes across as able-bodied. Using her two quirky best friends as sounding boards they explore society's need to label and stereotype, while yearning for Jeffrey Dean Morgan and keeping track of Rory Gilmore's love interests.\n\nThe 2018 winner of the 360 Degree Theatre Festival, this play was originally produced in Toronto by Tree of Life Theatre Company under the title \"Benefits Lapsed\".","times":["13th July at 12:30pm"],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"THE HEALING SHOW: Cosmic Cures for Catastrophic Cases","blurb":"When a comedic actress is victim of a serious car accident, trauma shifts to drama in this one-woman account of the power of energy healing to transform lives - maybe even for some lucky audience members!\n\nGiven no hope for recovery, battling depression and tortured by self-doubt and dysfunction, Sophia shares with us the healing modalities that brought her back from the brink of self-destruction and inspired her powerful new life direction.\n\nBoth irreverent and hilarious, this is a story of self-love and personal triumph!","times":["13th July at 8:30pm","14th July at 3:30pm"],"venue":{"place":"35 : Eastminster United Church Sanctuary","address":"310 Danforth AvenueTorontoOntarioM6J 1C5"}},{"name":"Personal Demon Hunter","blurb":"Velvet Duke is an internationally acclaimed motivational speaker. He is a gifted communicator skilled at exorcising your personal demons through his patented PATH!© system.\n\nToday his demons are getting their exercise. He will use every tool in his arsenal to vanquish them for good, including turning to you, his fans.","times":["13th July at 3:00pm","13th July at 8:00pm"],"venue":{"place":"30 : Imperial Pub","address":"54 Dundas St E,TorontoOntarioM5B 1C7"}},{"name":"I, Malvolio","blurb":"Is this the kind of thing you find funny?\nI’ll be revenged on the whole pack of you.\n\nA new production of Tim Crouch's acclaimed play. \"There is no way of knowing who gets the last laugh.\" - The Guardian\n\nFollow impel-theatre on snapchat starting July 1, leading up to, during, and following joining us at one of the live performances.","times":["13th July at 7:30pm"],"venue":{"place":"24 : Smart Cookie Club at Artscape Youngplace","address":"180 Shaw Street, Studio 107TorontoOntarioM6J 2W7"}},{"name":"Night Feed","blurb":"As an exhausted new mother nurses in the dark of yet another night, her apartment comes to life; possessions possessed with the demons of fear, self-doubt and anxiety, a chorus of objects and body parts. You know, standard parenting stuff. \n\nFringe veterans-turned-mothers Sarah Joy Bennett and Ginette Mohr return to Toronto Fringe with CLUNK Puppet Lab, turning their brand of imaginative storytelling to tackle motherhood, injecting a healthy dose of the bizarre and surreal to make sense of “the most meaningful time of your life”.","times":["13th July at 10:45pm","14th July at 2:30pm"],"venue":{"place":"2 : Tarragon Theatre Extraspace","address":"30 Bridgman AveOntarioM5R 1X3"}},{"name":"Anesti Danelis: Six Frets Under","blurb":"'Brilliant blend of sharp wit, optimism, and perfectly dark humour' 5/5 (EdFestMag.com). Anesti Danelis returns with a new hour of witty, ridiculous, and delightfully dark comedic songs that celebrate all the fun things in life like: identity crisis, stealing from work, inescapable rumours, alternative medicine, fearless youth, goats? and much more! So pull up a seat and let's ask life's biggest questions while toe-tapping that existential dread away. 'Not only were his songs expertly composed, the lyrics were freaking hilarious' (MooneyOnTheatre.com). Amused Moose Comedy Award finalist 2018. Canadian Comedy Award nominee 2019 #SixFretsUnder @anestidanelis","times":["13th July at 5:30pm","13th July at 7:00pm"],"venue":{"place":"16 : The Tranzac Club Tiki Room","address":"292 Brunswick AveTiki RoomTorontoOntarioM5S 2M7"}},{"name":"Audience of One","blurb":"Every performer's nightmare is having no one show up to their show, but what if only one person shows up? The show must go on right? Does the whole show change based on how one audience member reacts?\n\nTwo time Canadian national comedy award winner Eric Andrews takes his audience on a funny bizarre and sort of sad journey into his eclectic world using the forms of communication that shaped the person he has become.","times":["13th July at 6:45pm","14th July at 1:00pm"],"venue":{"place":"3 : Tarragon Theatre Solo Room","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"The Laundry List","blurb":"It's 1919, and Frankie's Laundry is gunning to be the number one bootlegger in Toronto. His competition thinks otherwise, and a group of chorus girls find themselves in a showdown of guns.....and tap shoes. The Laundry List will whisk you back to the golden age of jazz, flappers and gangsters. With live music, singing, and tap dancing, this cast of 12 will leave you with a song in your heart and a skip in your step.","times":["14th July at 5:45pm"],"venue":{"place":"12 : Factory Theatre Mainspace","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"UNRAVELLED - A New Musical","blurb":"“Romeo & Juliet”, “Orpheus & Eurydice”, and “The Gift Of The Magi” are brought together in this new musical by Andrew Seok - writer of the 2016 Fringe hit, “ECHOES”. With its soaring songs in the style of \"Les Misérables\" and interwoven plot akin to \"Into The Woods\", these three classic tales are retold and reimagined to create an entirely new and epically romantic story.","times":["13th July at 6:00pm"],"venue":{"place":"31 : Grace Toronto Church","address":"383 Jarvis St,TorontoOntarioM5B 2C7"}},{"name":"Tales Of A Cocktail","blurb":"The classic story of an innocent man wrongly, but deliberately sent to his demise and his brilliant strategy for revenge against those who betrayed him. Dashing young mobster Edward is a guileless and honest young man whose plans to marry the beautiful Mercedes and live a better life are abruptly shattered when his best friend who wants Mercedes for himself, deceives him. Told through a Chicago 1920s lens this dance adaptation brings to life the tale of The Count Of Monte Cristo.","times":["14th July at 12:00pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Eusha","blurb":"It's your worst nightmare. You wake up in pain and don't know where you are or how you got there. Luckily your nurse Eusha is there to care for you. She is lovely and connects with her patients on a deeper level. As you get to know Eusha, something seems unsettling. Your journey takes a dark turn as she retreats further and further into her own mind. Will you make it out alive? ★★4 1/2 STARS★★ \"Hypnotizing\"-Vue Weekly \"Haunting Performance\"- Edmonton Sun","times":["14th July at 7:45pm"],"venue":{"place":"2 : Tarragon Theatre Extraspace","address":"30 Bridgman AveOntarioM5R 1X3"}},{"name":"Emotional Labour","blurb":"Women far too often have to carry the emotional load in their relationships with men. And it's a load of exhausting, rage-inducing bullshit. So we wrote a play to talk about it. It's funny, educational, and provides solutions for some of these ongoing, fucking problems. And yes as a woman I'm a little pissed off -Jess\n\nCan we swear on the website? -Luis\n\nComedian Jess Beaulieu (Crimson Wave Comedy) joins forces with actor Luis Fernandes (The Assembly Theatre) to create a new comedy directed by Gwynne Phillips (The Templeton Philharmonic) and produced by Natalie Norman (Crimson Wave Comedy).","times":["13th July at 1:00pm","14th July at 7:45pm"],"venue":{"place":"13 : Factory Theatre Studio","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Mourning After the Night Before","blurb":"When a family moves to a small coastal town to recover from a tragedy, they struggle to rediscover who they are and if they're worth saving. \nLucy doesn't know who she is anymore. Everett is falling in love. Drew has lost so much already. Fenwick is just trying to keep her family afloat. \nAnd Pippa, well Pippa is drowning. \nMourning After the Night Before explores the rippling impact of loss and the repercussions of drowning in every way a person can drown.","times":["13th July at 10:15pm","14th July at 5:45pm"],"venue":{"place":"8 : Helen Gardiner Phelan Playhouse","address":"79A Saint George StTorontoOntarioM5S 3L8"}},{"name":"RADIOACTIVE SPYDER","blurb":"Radioactive Spyder, thirsty for power and fame, is determined to become Master of the Universe. Protozoa, the 14 billion-year-old single-celled being, guides Radioactive Spyder on his quest - showing him what the universe has to gain ... or to lose. This children's musical comedy is ultimately a wake up call for humanity and a call to action for the environment. A fun-loving musical set to a lively Cuban beat. Directed by Rae-Anna Maitland. Original music by Elizabeth Rodriguez and Magdelys Savigne. Featuring a song by Sarah Slean. Music directors are Kristen Zaza and Carissa Neufeld. Recommended for all ages.","times":["14th July at 2:30pm"],"venue":{"place":"0 : George Ignatieff Theatre","address":"15 Devonshire PlTorontoONM5S 2C8"}},{"name":"The December Man (L'homme de décembre)","blurb":"After their son survives the Montreal Massacre, the Fournier family struggles to hold themselves together. A play about survivors and the private challenges they face once the public face of tragedy has passed. \n\"Heartbreaking yet never sentimental, spare yet complex,\" The December Man (L'homme de décembre) was awarded the 2007 Governor General's Award. This site-specific production is performed near the site of the 2018 Danforth shooting and explores survivor's guilt following acts of public violence. \"A brave but important play.\"\nSet design: Ron McKay\nLighting design: Chris Bennett\nVoice & dialect coach: Christine Berg","times":["13th July at 6:00pm","14th July at 1:00pm"],"venue":{"place":"34 : Eastminster United Church Community Space","address":"310 Danforth Avenue, Toronto, ONM4K 1N6"}},{"name":"The Resistance Improvised","blurb":"Six rebels fight for freedom from an evil sci-fi dystopian government, but two in their midst are secretly traitors. Can they win back our freedoms or will suspicion and betrayal tear them apart from within.\n\nInspired by The Resistance board game. The traitors are so secret, even their fellow castmates don't know who is sabotaging their covert missions. Audience can guess along from their seats or watch knowing all along. Despite the stakes, this improv comedy is filled with cyber-hackers, sentient traffic robots, cyborg sports-stars, and serious laughs.","times":["13th July at 10:15pm","14th July at 3:30pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"BOYS DON'T CRY","blurb":"Fresh off a workshop production at the Red Sandcastle Theatre last summer, Boys Don't Cry follows Jayden Stone, a quirky, demure teenager trying to live up to the memory of his late father. When he falls in love with the new girl at school (a badass feminist with a passion for poetry and social justice) he is forced to reevaluate what it means to be a man. Award-winning young songwriter Mateo Lewis explores his complicated relationship with gender in this semi-autobiographical musical coming-of-age story.","times":["13th July at 5:45pm","14th July at 8:00pm"],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"An Utterly Stupid Indefensible Thing","blurb":"The sudden and untimely death of Connor Schatten spirals his classmates into a world of grief. But when an incriminating video of Connor surfaces, his school is left wondering what to think. Homer, Connor’s best friend, tries to clear the air, becoming immensely popular in the process. A year later, Homer is now days away from becoming the new University Student President. But a strange encounter with a mysterious loner named Augie threatens Homer’s upward trajectory.","times":["13th July at 8:30pm","14th July at 5:45pm"],"venue":{"place":"14 : Streetcar Crowsnest Guloien Theatre","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Great Lakes 5","blurb":"Dan \"Great\" Lake is a man of action! One scene after their parole, this charismatic thief is already working on his next scheme! With help from a mysterious client, (you in the audience) The Great Lakes 5 will embark on their most epic job yet!\n\nFrom the team that brought you the 4N \"Fallsview to a Kill\" in the 2018 Toronto Fringe Festival, comes the Narrative Improv show: \"Great Lakes 5\"! With audience suggestions, we will create a unique experience right in front of your eyes! \n\nThis improvised show may have loud music / SFX cues.","times":["13th July at 12:45pm","14th July at 6:45pm"],"venue":{"place":"7 : St. Vladimir Institute","address":"620 Spadina AveTorontoOntarioM5S 2H4"}},{"name":"Red Knows: A Play on Words","blurb":"A sassy scrumptious analysis of words and silence through the lens of human relationship and connection and complicated exaggeration around an exhilarating yet inspirational display of beautiful-not-perfect.","times":["13th July at 12:00pm","14th July at 3:30pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Horseface","blurb":"Meet Alex, a 61 year old woman who is charged with assaulting a man on a train. An older, mostly invisible and very British lady who is pushed to the limits when an innocuous encounter goes horribly wrong.\nHer experience of growing up as a good girl in the 1970's , her father's penchant for pornography, her years of being a great girlfriend to penniless musicians, and her rejection of Jane Fonda's sex advice all culminate in an explosive act.\nCome along for the ride and judge for yourself as to whether her defence is legitimate in an era of Twitter insults and the Me Too Movement.","times":["14th July at 12:15pm"],"venue":{"place":"6 : Annex Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"My Dad's Deaths (A Comedy)","blurb":"Multi-award-winning comedian and storyteller Jon Bennett has done plenty for his parents to be proud of. Jon is an acclaimed artist and a powerhouse of guts and gusto; a must-see performer of the real and the ridiculous. But his Dad doesn't get it.\n\nMy Dad's Deaths (A Comedy) is the story of the strange relationship between a comedian and his extremely conservative father; an accident-prone man who has died... more than once.\n\n“Armed only with self-deprecating wit and memories, Bennett reminds us that ordinary people lead extraordinary lives.” - The Sunday Mail (AUS)","times":["13th July at 10:15pm","14th July at 2:15pm"],"venue":{"place":"14 : Streetcar Crowsnest Guloien Theatre","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"Interrupted","blurb":"Interrupted is a deeply intricate and highly physical dance piece. The performances will invoke connections in your heart to the vulnerability of human reaction and adaption to change. This group of emerging dance artists will take you on a journey displaying familiar thoughts and emotions we often keep hidden within ourselves. These intangible insecurities will be cracked open and examined through reaction and response with solo, partner, and group work. Each performance will live and breathe to its own giving slight variations to the work and leaving each show unique to its audience.","times":["14th July at 1:45pm"],"venue":{"place":"4 : Al Green Theatre","address":"750 Spadina AveTorontoOntarioM5S 2J2"}},{"name":"Table 7 - A Plays in Cafes Creation","blurb":"Two different worlds collide in a busy Regent Park cafe and the altercation is layered with troubling undercurrents. \nWhen do you step into the middle of an unnerving situation? How do you know if what you think you saw is the truth? Every reality is skewed by the personal lens that we look through.\nCome witness the event and see what side of the table you’re on.","times":["13th July at 2:00pm"],"venue":{"place":"32 : Paintbox Bistro","address":"555 Dundas St ETorontoONM5A 2B7"}},{"name":"Scotch Tape","blurb":"5 million subscribers. Over a billion views. Massive internet following. Dreamboat fiancé. Maggie’s entire life is online—and it looks perfect. But when you take the viewer out from behind the computer screen and into her filming process, some things can't be glossed over with editing. Maggie vows to share her whole life with her loyal fanbase, but with that comes some ugly truths that she can’t even admit to herself. In the age of the internet where likes equal currency and image is everything, how far will Maggie go to look like she has it all together?","times":["13th July at 6:45pm","14th July at 4:15pm"],"venue":{"place":"15 : Streetcar Crowsnest Scotiabank Studio","address":"345 Carlaw AvenueTorontoONM4M 2T1"}},{"name":"An Orchid and Other Such Lilies and Lies","blurb":"Two friends drive through the desert. They have known each other a long time, but they don’t know how long. They don’t even know how old they are. They just remember a mutual friend from another lifetime and a run-down diner with a flowery name.\n\nWritten by Daniel Halpern\nDirected by David Woroner\nArtwork by Juliann Garisto\nStage Managed by Beth Airton","times":["13th July at 4:30pm","14th July at 6:00pm"],"venue":{"place":"13 : Factory Theatre Studio","address":"125 Bathurst StTorontoOntarioM5V 2R2"}},{"name":"Elbow Room","blurb":"Saada, Nancy, and Kia are force to holdup in a room with casting assistant Hanna, awaiting the start of a callback audition for the female lead in the Black action film, Cleopatra Jones. It’s a role that would bring international recognition to any actor who gets the job. So, rivalries, injuries, absurdities and mockery manifest themselves as the women jostle for career advantages during the delay.\n\n14A – 14 Accompaniment","times":["13th July at 2:30pm","14th July at 6:00pm"],"venue":{"place":"6 : Annex Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"BOY vs FLY","blurb":"BOY vs FLY, What could possibly go wrong? Dean Bean disrupts his class chasing a fly, trying to be just like his Dad. His impulsive nature gets him into trouble. Adapted from the book BOY versus FLY, this charming comedy will delight audiences of all ages. Dean's antics will entertain while teaching us a heartfelt lesson about owning up to your mistakes. Suitable for ages 4-UP\n\nBy Daniel Beitchman Director: Kerry Griffin Music Director: Ayaka Kinugawa Stage Manager: Heather Lacey\nCast: Devon Hyland, Spencer Litzinger, Simon McCamus, Josh Symonds, Brie Watson","times":["13th July at 12:15pm","14th July at 11:00am"],"venue":{"place":"0 : George Ignatieff Theatre","address":"15 Devonshire PlTorontoONM5S 2C8"}},{"name":"An Atlas, A Necktie & Other Concerns","blurb":"“Life is a bitchload of contradictions.\"... \"I won’t say you’re right.”... “Oh.” \nFour lifelong 30-something friends, each with very different takes on how to lead the best life, are locked in a strange escape room. There’s the sensible nine-to-fiver, the nonstop partier, the ambitious artiste and the peacekeeper with a potentially life-changing secret. Despite their one-of-a-kind love for one another, they can't seem to stop holding each other back. But if they can just 4-7-8 and put their longstanding beefs aside to solve the riddles, they might just break free. Written and directed by award-winning screenwriter Lauren Greenwood.","times":["13th July at 6:15pm","14th July at 4:15pm"],"venue":{"place":"1 : Tarragon Theatre Mainspace","address":"30 Bridgman AveTorontoOntarioM5R 1X3"}},{"name":"Ghosted: The Musical","blurb":"In this sci-fi/fantasy musical, Zohra is a realist looking for true love. Summer is a dreamer who hopes her graphic novel will become a success. A demon fairy wishes to get out of the vengeance game.\n \nZohra finds Clancy on a dating app called “Divine Valentine.” Unbeknownst to her, this app is run by demonic beings from a parallel universe, who lure unsuspecting humans into a bigger, more malicious trap. It’s up to Zohra, her friend Summer, and fringe scientist Harvard to thwart them. \n\n*A portion of the proceeds will go to Mental Health Canada.*","times":["14th July at 12:00pm"],"venue":{"place":"5 : Randolph Theatre","address":"736 Bathurst StTorontoOntarioM5S 1Z5"}},{"name":"Friendly Fire: The Art and Execution of Friendship","blurb":"Friends are great, aren't they? Wait, are they? They must be. Otherwise we wouldn't try so hard to make them. Or keep them. Or avoid them. Until we can cut them out... hmm. Sketch revues are great, aren't they? This one is! Grab some pals and join us for a romp amongst the minefields of friendship. Or, come alone. We're easy.\n\n#rideorbye #thefriendisnigh #whoinvitedchad?","times":["14th July at 4:00pm"],"venue":{"place":"9 : Robert Gill Theatre","address":"3rd Floor214 College StTorontoOntarioM5T 2Z9"}},{"name":"Spend Your Kids' Inheritance","blurb":"In this reverse coming-of-age musical comedy-drama, four seniors plot to regain control of their finances and escape their southern Ontario retirement home. A newcomer upsets the status quo at Alpine Home, unleashing repressed desires and igniting conflict between staff and residents and their adult children. These struggles, and their dreams for their futures, create a bond between four of the home's residents. They embark on a journey that forces them to wrestle with the power of choice and its consequences, and that challenges stereotypes about age, love, family, friendship ... and freedom.","times":["13th July at 4:30pm","14th July at 1:45pm"],"venue":{"place":"8 : Helen Gardiner Phelan Playhouse","address":"79A Saint George StTorontoOntarioM5S 3L8"}},{"name":"Clitoria: A Sex-Positive Superhero!","blurb":"A sexually repressed high school science teacher accidentally turns herself into a sex-positive Vixen of Kink through a science experiment gone wrong. As the sex ed curriculum is scrapped in Ontario, Clitoria's transformation wreaks havoc on her square life and her square fiancé. Musical comedy unfolds in hot, steamy, and unexpected ways!","times":["13th July at 10:15pm","14th July at 8:00pm"],"venue":{"place":"10 : Theatre Passe Muraille Mainspace","address":"16 Ryerson AveTorontoOntarioM5T 2P3"}},{"name":"Clotheswap","blurb":"An empty house, a dead grandmother, and too many clothes. \nThis co-production with The Textile Museum of Canada examines the seams of empathy among women, the high cost of fast fashion, and the stories our bodies tell. Audience can bring clothing to swap and donate to Sistering & Dress For Success. Each ticket provides free admission to the museum. Directed by Dale Boyer and featuring Amanda Barker, Cassie Cao, Ashley Comeau, Tarah Consoli, and Karen Parker.\nwww.clotheswapshow.com\n@clotheswapshow","times":["13th July at 12:00pm"],"venue":{"place":"29 : The Textile Museum of Canada","address":"55 Centre Ave,TorontoONM5G 2H5"}}]